package com.liao.momo.model;

import java.util.List;

/**
 * Created by Administrator on 2016-10-29.
 */
public class JokeBean {

    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"allPages":1207,"ret_code":0,"contentlist":[{"id":"58132fcc6e3677cd3251a181","title":"朋友问我：你怎么看待","text":"朋友问我：你怎么看待里皮到中国国足执教？我：土豪给家里的智障儿子请了个清华大学的家教。","type":1,"ct":"2016-10-28 19:00:28.977"},{"id":"5813294f6e3677cd32518a5f","title":"昨天和老婆在马路上，","text":"昨天和老婆在马路上，老婆假装把我往路上推，\r\n我：\u201c真出事，咱家就没盼头了。\u201d\r\n老婆：\u201c真出事，咱家才有盼头！\u201d\r\n儿子在后面悻悻的说：\u201c恩，能赔好几十万呢！\u201d\r\n我。。。","type":1,"ct":"2016-10-28 18:32:47.750"},{"id":"581321d16e3677cd32516a0d","text":"妈妈偷看了儿子的日记，妈妈：\u201c哎呦！你还写诗呢，还春风暖意的，跟谁呀？\u201d儿子：\u201c你偷看我日记，这是我的隐私。\u201d妈妈：\u201c隐私？我是妈你还有隐私？有隐私你出生的时候咋不穿个裤衩啊？\u201d","title":"爆笑的爸妈,悲催的孩子","type":1,"ct":"2016-10-28 18:00:49.295"},{"id":"581321d16e3677cd32516a0c","text":"铁沙掌，基本上我爸一巴掌，我就被打飞了。","title":"小时侯挨打,爸妈用的那些恐怖武器","type":1,"ct":"2016-10-28 18:00:49.261"},{"id":"581321d16e3677cd32516a0b","text":"上班路上看到的，早上看到一大爷推着个婴儿车在非机动车道上走。。。后面有个银行运钞车开进非机动车道，看见大爷挡了道就不停的按喇叭。大爷回头看了一眼，没理他，继续慢慢的推着婴儿车走，嘴里嘟囔着：你是车，我这也是车\u2026\u2026","title":"夕阳岁月的冷幽默","type":1,"ct":"2016-10-28 18:00:49.260"},{"id":"581321d16e3677cd32516a0a","text":"老公体重已超过一百公斤，每次跟女儿散步，女儿都会说：\u201c老爸，您这一身肉，走起来颤颤忽忽的，看着就腻歪。\u201d老公受了刺激，去健身房锻炼了两个月。这天，他在女儿眼前显摆：\u201c看，我身上都有肌肉了。\u201d女儿看了看，又摸了摸，满意地点点头说：\u201c老爸，你确实比以前好多了，已经从\u2018看着就腻歪\u2019进步到\u2018肥而不腻\u2019的阶段了。\u201d","title":"搞笑的居家郁闷糗事","type":1,"ct":"2016-10-28 18:00:49.256"},{"id":"581321d16e3677cd32516a08","text":"\u201c事到如今，我也不想再隐瞒你了，其实，我并不是你爸爸。\u201d\u201c你是不是缺心眼啊，妈。\u201d","title":"爆笑亲子,被他(她)们惊呆了","type":1,"ct":"2016-10-28 18:00:49.195"},{"id":"581321d06e3677cd32516a07","text":"老妈给我发短信：\u201c你爸闲得慌，正在钓鱼呢。\u201d我问：\u201c钓了几条了？\u201d老妈：\u201c刚好3条。\u201d我赞一句：\u201c在那儿钓的，我也要去钓。\u201d老妈：\u201c在你养的鱼缸里钓的。\u201d","title":"老爸老妈的幽默雷事儿","type":1,"ct":"2016-10-28 18:00:48.752"},{"id":"581321d06e3677cd32516a06","text":"有个男孩很淘气，晚上，男孩死活要出去踢球，妈妈不让，非要他去练钢琴。男孩开门要往楼下跑，他妈妈一手拎住了男孩胳膊，一手狠狠扇在孩子他爸脸上，大吼：\u201c不好好学习，以后娶个老婆就像我这么凶１男孩看看他爸爸红肿的脸，默默的进门回去了。","title":"爆囧的神级爸妈","type":1,"ct":"2016-10-28 18:00:48.752"},{"id":"581321d06e3677cd32516a05","text":"餐厅里，妈妈给大概三四岁的女儿点了一杯九珍果汁和一对鸡翅。端过来之后妈妈拿起饮料说：\u201c我尝尝冰不冰。\u201d然后就一口气喝完了。","title":"总想幽孩子一默的爆笑家长","type":1,"ct":"2016-10-28 18:00:48.751"},{"id":"581321d06e3677cd32516a04","text":"中午没事做陪老妈看男生女生向前冲，今天女生战绩不佳\u2026众美女纷纷落水\u2026老妈突然来了一句：要不你去应聘他们的救生员吧，想抱谁就抱谁，想怎么摸就怎么摸\u2026\u2026","title":"把孩子囧翻的爆雷父母","type":1,"ct":"2016-10-28 18:00:48.751"},{"id":"581321d06e3677cd32516a03","text":"儿子放学回家，爸爸问：\u201c说一说，你们学校里有什么新鲜事？\u201d儿子答：\u201c糟透了，考试两门不及格。\u201d爸爸叹气道：\u201c唉，这算什么新鲜事\u2026\u2026\u201d","title":"笑翻了的二货父子","type":1,"ct":"2016-10-28 18:00:48.710"},{"id":"581313df6e3677cd32513d4e","text":"<p>\r\n\t\t1、男追女，女拒绝，说：\u201c我们没有共同点，不合适。\u201d<p><\/p>\r\n男：\u201c你爸比你大不？\u201d<p><\/p>\r\n女：\u201c废话\u201d<p><\/p>\r\n男：\u201c你爸比你大，我爸也比我大，这不是共同点？\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、我：不愧大家都称你女神，你无论外貌，身材，品行，智慧都已近乎完美了，但是你还差一点就完美了！<p><\/p>\r\n女神：差什么？<p><\/p>\r\n我：差我这个男朋友呗！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、男：认识我吗？<p><\/p>\r\n女：不认识。<p><\/p>\r\n男：这么巧！我也不认识你！也许这就是缘分吧！\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、A：\u201c你女朋友只是喜欢你的钱，并不喜欢你。\u201d<p><\/p>......","title":"没脸没皮的男银泡妹子","type":1,"ct":"2016-10-28 17:01:19.472"},{"id":"581313df6e3677cd32513d49","text":"<p>\r\n\t\t1、我再重申一遍！！骂我朋友可以 ，骂我不行；说我帅可以，说我朋友帅不行；打我朋友可以，但我警告你，打我不行！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、今天我做了个决定，以后上班坐地铁一定要带个大榴莲，和那些吃韭菜包子的人，同归于尽！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、点了一份娃娃菜，一份夫妻肺片，一份外婆菜。不为别的，就是希望吃一桌团圆饭。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、当有蚊子趴在你身上的时候，不要赶走它，让它咬，当它开始咬你皮肤开始吸血的时候，憋一口气，猛的全身用力，加速血液循环，呛死它狗日的！！\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、每次跟老婆吵完架，小舅子就会跑到我家跟老婆说：\u201c你怎么又和我姐夫吵架，你这脾气得改改了！ \u201d<p><\/p>......","title":"幽默有趣的欠揍逗B","type":1,"ct":"2016-10-28 17:01:19.419"},{"id":"581313df6e3677cd32513d47","title":"熄灯后，和寝室几个聊","text":"熄灯后，和寝室几个聊星座。我疑惑的问了句：为什么只有处女座，没有处男座？\r\n然后上铺彪悍的回答：怎么没有，只不过后来改名了，叫做射手座！","type":1,"ct":"2016-10-28 17:01:19.258"},{"id":"581313df6e3677cd32513d46","text":"<p>\r\n\t\t1、昨晚睡了一个日本女孩，叫亚麻席子。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、女神：又月底了，今天房东要来收房租了。<p><\/p>\r\n我：那你就交房租啊，这有什么大不了的！<p><\/p>\r\n女神：可是我大夷妈来了，这房租可咋办哦！！！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、以前见过这么几句话：\u201c我姓刘，却留不住你的心，我姓李，却理不清你的情，我姓张，却张不开嘴说爱你\u201d<p><\/p>\r\n现在我感觉这些都弱爆了，今天看见一个：\u201c我姓高，却给不了你高潮。。。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、员工：\u201c老板，请个假。\u201d<p><\/p>\r\n老板：\u201c干嘛去？\u201d<p><\/p>\r\n员工：\u201c我女朋友怀孕了我要陪她去打胎！ \u201d<p><\/p>......","title":"嘿嘿,我的笑后感是真含蓄","type":1,"ct":"2016-10-28 17:01:19.257"},{"id":"581313df6e3677cd32513d45","title":"一女的跟自己喜欢的男","text":"一女的跟自己喜欢的男人说：\u201c希望不远的将来，我会在你家的餐桌上。\u201d\r\n男孩回：\u201c你要变红烧猪头？\u201d","type":1,"ct":"2016-10-28 17:01:19.257"},{"id":"581313df6e3677cd32513d3f","text":"<p>\r\n\t\t1、男生拉着女生沮丧着脸说，再给我一次机会，求求你！说好不提分手的！<p><\/p>\r\n女生甩开男孩的手说：你TM现在在我心里就是个菩萨，除了拜拜我什么都不想做。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、我表妹学医回来后，我问她：\u201c男人那个方面不理想的话怎么治疗？\u201d<p><\/p>\r\n表妹说：\u201c我是学外科的，我们老师说哪里坏了就把那里割掉就行。\u201d<p><\/p>\r\n听完一阵蛋疼。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、男：\u201c亲爱的，我希望我们以后不要吵架了，你知道，两个人吵架，就像拔河。\u201d<p><\/p>\r\n女：\u201c一边放手，另一边就会受伤？\u201d<p><\/p>\r\n男：\u201c没那么深刻啦，我只是想说总是胖的那边赢，没意思。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、女问：你们男人为什么喜欢苗条的？<p><\/p>......","title":"爆笑里藏刀,伤害指数极高","type":1,"ct":"2016-10-28 17:01:19.150"},{"id":"581313df6e3677cd32513d3e","text":"<p>\r\n\t\t1、一二货朋友昨天喝完酒带骑车送女友回家，因为是乡间小路，不小心摔翻稻田里了，第二天告诉我们分手了，问他为何？<p><\/p>\r\n他说那女的脑子有问题，都摔了，还有心情唱歌：\u201c朋友你今天就要远走，干了这杯酒！ \u201d<p><\/p>\r\n角落里幽幽的传来一句话：\u201cSB，她是要和你田震！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、夏天，公司一美女同事外套的衣服穿的很薄，能透过外衣看到她每天穿不同颜色的内内，有天同事都聚一起聊这个事儿，我说怎么没见他穿过白色的啊？<p><\/p>\r\n结果下午被头儿叫进办公室问我，原来你小子上周三没上班啊，扣你工资。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、和朋友上街，看到一女子，背影那叫一个销魂埃。。<p><\/p>......","title":"内涵\u201c才\u201d子,特别的醉人","type":1,"ct":"2016-10-28 17:01:19.150"},{"id":"581313df6e3677cd32513d3d","text":"<p>\r\n\t\t1、7.9日是世界无胸罩日，这么热的天，我在大街上蹲一上午了，发现妹子们压根不过这个节！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、人一般在高朝过后，百分之一的人会去嘘嘘，百分之二的人会睡着，百分之七的人会抽烟，剩下的那百分之九十，会选择关闭播放器。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、一直讨厌自己滥情，伤害了一个个女孩的心。。。<p><\/p>\r\n看破红尘的我决定遁入空门，只是出家不到一个月，我又爱上了几个前来上香的女施主。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、一个男人爱你，一定是有原因的。<p><\/p>\r\n如果你好看，他也许是爱你的美貌；<p><\/p>\r\n如果你有钱，他可能是爱你的钱财；<p><\/p>......","title":"爆笑,一颗按耐不住的春心","type":1,"ct":"2016-10-28 17:01:19.150"}],"currentPage":1,"allNum":24140,"maxResult":20}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    /**
     * allPages : 1207
     * ret_code : 0
     * contentlist : [{"id":"58132fcc6e3677cd3251a181","title":"朋友问我：你怎么看待","text":"朋友问我：你怎么看待里皮到中国国足执教？我：土豪给家里的智障儿子请了个清华大学的家教。","type":1,"ct":"2016-10-28 19:00:28.977"},{"id":"5813294f6e3677cd32518a5f","title":"昨天和老婆在马路上，","text":"昨天和老婆在马路上，老婆假装把我往路上推，\r\n我：\u201c真出事，咱家就没盼头了。\u201d\r\n老婆：\u201c真出事，咱家才有盼头！\u201d\r\n儿子在后面悻悻的说：\u201c恩，能赔好几十万呢！\u201d\r\n我。。。","type":1,"ct":"2016-10-28 18:32:47.750"},{"id":"581321d16e3677cd32516a0d","text":"妈妈偷看了儿子的日记，妈妈：\u201c哎呦！你还写诗呢，还春风暖意的，跟谁呀？\u201d儿子：\u201c你偷看我日记，这是我的隐私。\u201d妈妈：\u201c隐私？我是妈你还有隐私？有隐私你出生的时候咋不穿个裤衩啊？\u201d","title":"爆笑的爸妈,悲催的孩子","type":1,"ct":"2016-10-28 18:00:49.295"},{"id":"581321d16e3677cd32516a0c","text":"铁沙掌，基本上我爸一巴掌，我就被打飞了。","title":"小时侯挨打,爸妈用的那些恐怖武器","type":1,"ct":"2016-10-28 18:00:49.261"},{"id":"581321d16e3677cd32516a0b","text":"上班路上看到的，早上看到一大爷推着个婴儿车在非机动车道上走。。。后面有个银行运钞车开进非机动车道，看见大爷挡了道就不停的按喇叭。大爷回头看了一眼，没理他，继续慢慢的推着婴儿车走，嘴里嘟囔着：你是车，我这也是车\u2026\u2026","title":"夕阳岁月的冷幽默","type":1,"ct":"2016-10-28 18:00:49.260"},{"id":"581321d16e3677cd32516a0a","text":"老公体重已超过一百公斤，每次跟女儿散步，女儿都会说：\u201c老爸，您这一身肉，走起来颤颤忽忽的，看着就腻歪。\u201d老公受了刺激，去健身房锻炼了两个月。这天，他在女儿眼前显摆：\u201c看，我身上都有肌肉了。\u201d女儿看了看，又摸了摸，满意地点点头说：\u201c老爸，你确实比以前好多了，已经从\u2018看着就腻歪\u2019进步到\u2018肥而不腻\u2019的阶段了。\u201d","title":"搞笑的居家郁闷糗事","type":1,"ct":"2016-10-28 18:00:49.256"},{"id":"581321d16e3677cd32516a08","text":"\u201c事到如今，我也不想再隐瞒你了，其实，我并不是你爸爸。\u201d\u201c你是不是缺心眼啊，妈。\u201d","title":"爆笑亲子,被他(她)们惊呆了","type":1,"ct":"2016-10-28 18:00:49.195"},{"id":"581321d06e3677cd32516a07","text":"老妈给我发短信：\u201c你爸闲得慌，正在钓鱼呢。\u201d我问：\u201c钓了几条了？\u201d老妈：\u201c刚好3条。\u201d我赞一句：\u201c在那儿钓的，我也要去钓。\u201d老妈：\u201c在你养的鱼缸里钓的。\u201d","title":"老爸老妈的幽默雷事儿","type":1,"ct":"2016-10-28 18:00:48.752"},{"id":"581321d06e3677cd32516a06","text":"有个男孩很淘气，晚上，男孩死活要出去踢球，妈妈不让，非要他去练钢琴。男孩开门要往楼下跑，他妈妈一手拎住了男孩胳膊，一手狠狠扇在孩子他爸脸上，大吼：\u201c不好好学习，以后娶个老婆就像我这么凶１男孩看看他爸爸红肿的脸，默默的进门回去了。","title":"爆囧的神级爸妈","type":1,"ct":"2016-10-28 18:00:48.752"},{"id":"581321d06e3677cd32516a05","text":"餐厅里，妈妈给大概三四岁的女儿点了一杯九珍果汁和一对鸡翅。端过来之后妈妈拿起饮料说：\u201c我尝尝冰不冰。\u201d然后就一口气喝完了。","title":"总想幽孩子一默的爆笑家长","type":1,"ct":"2016-10-28 18:00:48.751"},{"id":"581321d06e3677cd32516a04","text":"中午没事做陪老妈看男生女生向前冲，今天女生战绩不佳\u2026众美女纷纷落水\u2026老妈突然来了一句：要不你去应聘他们的救生员吧，想抱谁就抱谁，想怎么摸就怎么摸\u2026\u2026","title":"把孩子囧翻的爆雷父母","type":1,"ct":"2016-10-28 18:00:48.751"},{"id":"581321d06e3677cd32516a03","text":"儿子放学回家，爸爸问：\u201c说一说，你们学校里有什么新鲜事？\u201d儿子答：\u201c糟透了，考试两门不及格。\u201d爸爸叹气道：\u201c唉，这算什么新鲜事\u2026\u2026\u201d","title":"笑翻了的二货父子","type":1,"ct":"2016-10-28 18:00:48.710"},{"id":"581313df6e3677cd32513d4e","text":"<p>\r\n\t\t1、男追女，女拒绝，说：\u201c我们没有共同点，不合适。\u201d<p><\/p>\r\n男：\u201c你爸比你大不？\u201d<p><\/p>\r\n女：\u201c废话\u201d<p><\/p>\r\n男：\u201c你爸比你大，我爸也比我大，这不是共同点？\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、我：不愧大家都称你女神，你无论外貌，身材，品行，智慧都已近乎完美了，但是你还差一点就完美了！<p><\/p>\r\n女神：差什么？<p><\/p>\r\n我：差我这个男朋友呗！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、男：认识我吗？<p><\/p>\r\n女：不认识。<p><\/p>\r\n男：这么巧！我也不认识你！也许这就是缘分吧！\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、A：\u201c你女朋友只是喜欢你的钱，并不喜欢你。\u201d<p><\/p>......","title":"没脸没皮的男银泡妹子","type":1,"ct":"2016-10-28 17:01:19.472"},{"id":"581313df6e3677cd32513d49","text":"<p>\r\n\t\t1、我再重申一遍！！骂我朋友可以 ，骂我不行；说我帅可以，说我朋友帅不行；打我朋友可以，但我警告你，打我不行！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、今天我做了个决定，以后上班坐地铁一定要带个大榴莲，和那些吃韭菜包子的人，同归于尽！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、点了一份娃娃菜，一份夫妻肺片，一份外婆菜。不为别的，就是希望吃一桌团圆饭。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、当有蚊子趴在你身上的时候，不要赶走它，让它咬，当它开始咬你皮肤开始吸血的时候，憋一口气，猛的全身用力，加速血液循环，呛死它狗日的！！\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、每次跟老婆吵完架，小舅子就会跑到我家跟老婆说：\u201c你怎么又和我姐夫吵架，你这脾气得改改了！ \u201d<p><\/p>......","title":"幽默有趣的欠揍逗B","type":1,"ct":"2016-10-28 17:01:19.419"},{"id":"581313df6e3677cd32513d47","title":"熄灯后，和寝室几个聊","text":"熄灯后，和寝室几个聊星座。我疑惑的问了句：为什么只有处女座，没有处男座？\r\n然后上铺彪悍的回答：怎么没有，只不过后来改名了，叫做射手座！","type":1,"ct":"2016-10-28 17:01:19.258"},{"id":"581313df6e3677cd32513d46","text":"<p>\r\n\t\t1、昨晚睡了一个日本女孩，叫亚麻席子。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、女神：又月底了，今天房东要来收房租了。<p><\/p>\r\n我：那你就交房租啊，这有什么大不了的！<p><\/p>\r\n女神：可是我大夷妈来了，这房租可咋办哦！！！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、以前见过这么几句话：\u201c我姓刘，却留不住你的心，我姓李，却理不清你的情，我姓张，却张不开嘴说爱你\u201d<p><\/p>\r\n现在我感觉这些都弱爆了，今天看见一个：\u201c我姓高，却给不了你高潮。。。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、员工：\u201c老板，请个假。\u201d<p><\/p>\r\n老板：\u201c干嘛去？\u201d<p><\/p>\r\n员工：\u201c我女朋友怀孕了我要陪她去打胎！ \u201d<p><\/p>......","title":"嘿嘿,我的笑后感是真含蓄","type":1,"ct":"2016-10-28 17:01:19.257"},{"id":"581313df6e3677cd32513d45","title":"一女的跟自己喜欢的男","text":"一女的跟自己喜欢的男人说：\u201c希望不远的将来，我会在你家的餐桌上。\u201d\r\n男孩回：\u201c你要变红烧猪头？\u201d","type":1,"ct":"2016-10-28 17:01:19.257"},{"id":"581313df6e3677cd32513d3f","text":"<p>\r\n\t\t1、男生拉着女生沮丧着脸说，再给我一次机会，求求你！说好不提分手的！<p><\/p>\r\n女生甩开男孩的手说：你TM现在在我心里就是个菩萨，除了拜拜我什么都不想做。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、我表妹学医回来后，我问她：\u201c男人那个方面不理想的话怎么治疗？\u201d<p><\/p>\r\n表妹说：\u201c我是学外科的，我们老师说哪里坏了就把那里割掉就行。\u201d<p><\/p>\r\n听完一阵蛋疼。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、男：\u201c亲爱的，我希望我们以后不要吵架了，你知道，两个人吵架，就像拔河。\u201d<p><\/p>\r\n女：\u201c一边放手，另一边就会受伤？\u201d<p><\/p>\r\n男：\u201c没那么深刻啦，我只是想说总是胖的那边赢，没意思。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、女问：你们男人为什么喜欢苗条的？<p><\/p>......","title":"爆笑里藏刀,伤害指数极高","type":1,"ct":"2016-10-28 17:01:19.150"},{"id":"581313df6e3677cd32513d3e","text":"<p>\r\n\t\t1、一二货朋友昨天喝完酒带骑车送女友回家，因为是乡间小路，不小心摔翻稻田里了，第二天告诉我们分手了，问他为何？<p><\/p>\r\n他说那女的脑子有问题，都摔了，还有心情唱歌：\u201c朋友你今天就要远走，干了这杯酒！ \u201d<p><\/p>\r\n角落里幽幽的传来一句话：\u201cSB，她是要和你田震！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、夏天，公司一美女同事外套的衣服穿的很薄，能透过外衣看到她每天穿不同颜色的内内，有天同事都聚一起聊这个事儿，我说怎么没见他穿过白色的啊？<p><\/p>\r\n结果下午被头儿叫进办公室问我，原来你小子上周三没上班啊，扣你工资。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、和朋友上街，看到一女子，背影那叫一个销魂埃。。<p><\/p>......","title":"内涵\u201c才\u201d子,特别的醉人","type":1,"ct":"2016-10-28 17:01:19.150"},{"id":"581313df6e3677cd32513d3d","text":"<p>\r\n\t\t1、7.9日是世界无胸罩日，这么热的天，我在大街上蹲一上午了，发现妹子们压根不过这个节！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、人一般在高朝过后，百分之一的人会去嘘嘘，百分之二的人会睡着，百分之七的人会抽烟，剩下的那百分之九十，会选择关闭播放器。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、一直讨厌自己滥情，伤害了一个个女孩的心。。。<p><\/p>\r\n看破红尘的我决定遁入空门，只是出家不到一个月，我又爱上了几个前来上香的女施主。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、一个男人爱你，一定是有原因的。<p><\/p>\r\n如果你好看，他也许是爱你的美貌；<p><\/p>\r\n如果你有钱，他可能是爱你的钱财；<p><\/p>......","title":"爆笑,一颗按耐不住的春心","type":1,"ct":"2016-10-28 17:01:19.150"}]
     * currentPage : 1
     * allNum : 24140
     * maxResult : 20
     */

    private ShowapiResBodyBean showapi_res_body;

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        private int allPages;
        private int ret_code;
        private int currentPage;
        private int allNum;
        private int maxResult;
        /**
         * id : 58132fcc6e3677cd3251a181
         * title : 朋友问我：你怎么看待
         * text : 朋友问我：你怎么看待里皮到中国国足执教？我：土豪给家里的智障儿子请了个清华大学的家教。
         * type : 1
         * ct : 2016-10-28 19:00:28.977
         */

        private List<ContentlistBean> contentlist;

        public int getAllPages() {
            return allPages;
        }

        public void setAllPages(int allPages) {
            this.allPages = allPages;
        }

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getAllNum() {
            return allNum;
        }

        public void setAllNum(int allNum) {
            this.allNum = allNum;
        }

        public int getMaxResult() {
            return maxResult;
        }

        public void setMaxResult(int maxResult) {
            this.maxResult = maxResult;
        }

        public List<ContentlistBean> getContentlist() {
            return contentlist;
        }

        public void setContentlist(List<ContentlistBean> contentlist) {
            this.contentlist = contentlist;
        }

        public static class ContentlistBean {
            private String id;
            private String title;
            private String text;
            private int type;
            private String ct;

            public String getId() {
                return id;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public String getText() {
                return text;
            }

            public void setText(String text) {
                this.text = text;
            }

            public int getType() {
                return type;
            }

            public void setType(int type) {
                this.type = type;
            }

            public String getCt() {
                return ct;
            }

            public void setCt(String ct) {
                this.ct = ct;
            }
        }
    }
}
